{
  "ID": "oval:cn.openanolis:def:20230143",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2023:0143: ANSA: kernel security and bug fix update: kernel-4.19.91-27.2 (Important)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 7"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2023:0143",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2023:0143",
        "Source": "ANSA"
      }
    ],
    "Description": "The Linux kernel, based on version 4.19.91, heavily modified with backports\n\nCVE-2020-14331:\nA flaw was found in the Linux kernel’s implementation of the invert video code on VGA consoles when a local attacker attempts to resize the console, calling an ioctl VT_RESIZE, which causes an out-of-bounds write to occur. This flaw allows a local user with access to the VGA console to crash the system, potentially escalating their privileges on the system. The highest threat from this vulnerability is to data confidentiality and integrity as well as system availability.\n\nCVE-2020-25670:\nA vulnerability was found in Linux Kernel where refcount leak in llcp_sock_bind() causing use-after-free which might lead to privilege escalations.\n\nCVE-2020-25671:\nA vulnerability was found in Linux Kernel, where a refcount leak in llcp_sock_connect() causing use-after-free which might lead to privilege escalations.\n\nCVE-2020-25672:\nA memory leak vulnerability was found in Linux kernel in llcp_sock_connect\n\nCVE-2021-3759:\nA memory overflow vulnerability was found in the Linux kernel’s ipc functionality of the memcg subsystem, in the way a user calls the semget function multiple times, creating semaphores. This flaw allows a local user to starve the resources, causing a denial of service. The highest threat from this vulnerability is to system availability.\n\nCVE-2021-3923:\nA flaw was found in the Linux kernel's implementation of RDMA over infiniband. An attacker with a privileged local account can leak kernel stack information when issuing commands to the /dev/infiniband/rdma_cm device node. While this access is unlikely to leak sensitive user information, it can be further used to defeat existing kernel protection mechanisms.\n\nCVE-2022-1975:\nThere is a sleep-in-atomic bug in /net/nfc/netlink.c that allows an attacker to crash the Linux kernel by simulating a nfc device from user-space.\n\nCVE-2022-20566:\nIn l2cap_chan_put of l2cap_core, there is a possible use after free due to improper locking. This could lead to local escalation of privilege with no additional execution privileges needed. User interaction is not needed for exploitation.Product: AndroidVersions: Android kernelAndroid ID: A-165329981References: Upstream kernel\n\nCVE-2022-2964:\nA flaw was found in the Linux kernel’s driver for the ASIX AX88179_178A-based USB 2.0/3.0 Gigabit Ethernet Devices. The vulnerability contains multiple out-of-bounds reads and possible out-of-bounds writes.\n\nCVE-2022-3107:\nAn issue was discovered in the Linux kernel through 5.16-rc6. netvsc_get_ethtool_stats in drivers/net/hyperv/netvsc_drv.c lacks check of the return value of kvmalloc_array() and will cause the null pointer dereference.\n\nCVE-2022-3108:\nAn issue was discovered in the Linux kernel through 5.16-rc6. kfd_parse_subtype_iolink in drivers/gpu/drm/amd/amdkfd/kfd_crat.c lacks check of the return value of kmemdup().\n\nCVE-2022-3111:\nAn issue was discovered in the Linux kernel through 5.16-rc6. free_charger_irq() in drivers/power/supply/wm8350_power.c lacks free of WM8350_IRQ_CHG_FAST_RDY, which is registered in wm8350_init_charger().\n\nCVE-2022-3239:\nA flaw use after free in the Linux kernel video4linux driver was found in the way user triggers em28xx_usb_probe() for the Empia 28xx based TV cards. A local user could use this flaw to crash the system or potentially escalate their privileges on the system.\n\nCVE-2022-33741:\nLinux disk/nic frontends data leaks T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] Linux Block and Network PV device frontends don't zero memory regions before sharing them with the backend (CVE-2022-26365, CVE-2022-33740). Additionally the granularity of the grant table doesn't allow sharing less than a 4K page, leading to unrelated data residing in the same 4K page as data shared with a backend being accessible by such backend (CVE-2022-33741, CVE-2022-33742).\n\nCVE-2022-3524:\nA vulnerability was found in Linux Kernel. It has been declared as problematic. Affected by this vulnerability is the function ipv6_renew_options of the component IPv6 Handler. The manipulation leads to memory leak. The attack can be launched remotely. It is recommended to apply a patch to fix this issue. The identifier VDB-211021 was assigned to this vulnerability.\n\nCVE-2022-3535:\nA vulnerability classified as problematic was found in Linux Kernel. Affected by this vulnerability is the function mvpp2_dbgfs_port_init of the file drivers/net/ethernet/marvell/mvpp2/mvpp2_debugfs.c of the component mvpp2. The manipulation leads to memory leak. It is recommended to apply a patch to fix this issue. The identifier VDB-211033 was assigned to this vulnerability.\n\nCVE-2022-3564:\nA vulnerability classified as critical was found in Linux Kernel. Affected by this vulnerability is the function l2cap_reassemble_sdu of the file net/bluetooth/l2cap_core.c of the component Bluetooth. The manipulation leads to use after free. It is recommended to apply a patch to fix this issue. The associated identifier of this vulnerability is VDB-211087.\n\nCVE-2022-3566:\nA vulnerability, which was classified as problematic, was found in Linux Kernel. This affects the function tcp_getsockopt/tcp_setsockopt of the component TCP Handler. The manipulation leads to race condition. It is recommended to apply a patch to fix this issue. The identifier VDB-211089 was assigned to this vulnerability.\n\nCVE-2022-41218:\nIn drivers/media/dvb-core/dmxdev.c in the Linux kernel through 5.19.10, there is a use-after-free caused by refcount races, affecting dvb_demux_open and dvb_dmxdev_release.\n\nCVE-2022-4129:\nA flaw was found in the Linux kernel's Layer 2 Tunneling Protocol (L2TP). A missing lock when clearing sk_user_data can lead to a race condition and NULL pointer dereference. A local user could use this flaw to potentially crash the system causing a denial of service.\n\nCVE-2022-41858:\nA flaw was found in the Linux kernel. A NULL pointer dereference may occur while a slip driver is in progress to detach in sl_tx_timeout in drivers/net/slip/slip.c. This issue could allow an attacker to crash the system or leak internal kernel information.\n\nCVE-2022-42328:\nGuests can trigger deadlock in Linux netback driver T[his CNA information record relates to multiple CVEs; the text explains which aspects/vulnerabilities correspond to which CVE.] The patch for XSA-392 introduced another issue which might result in a deadlock when trying to free the SKB of a packet dropped due to the XSA-392 handling (CVE-2022-42328). Additionally when dropping packages for other reasons the same deadlock could occur in case of netpoll being active for the interface the xen-netback driver is connected to (CVE-2022-42329).\n\nCVE-2022-42703:\nmm/rmap.c in the Linux kernel before 5.19.7 has a use-after-free related to leaf anon_vma double reuse.\n\nCVE-2022-42896:\nThere are use-after-free vulnerabilities in the Linux kernel's net/bluetooth/l2cap_core.c's l2cap_connect and l2cap_le_connect_req functions which may allow code execution and leaking kernel memory (respectively) remotely via Bluetooth. A remote attacker could execute code leaking kernel memory via Bluetooth if within proximity of the victim. We recommend upgrading past commit https://www.google.com/url https://github.com/torvalds/linux/commit/711f8c3fb3db61897080468586b970c87c61d9e4 https://www.google.com/url\n\nCVE-2022-45934:\nAn issue was discovered in the Linux kernel through 6.0.10. l2cap_config_req in net/bluetooth/l2cap_core.c has an integer wraparound via L2CAP_CONF_REQ packets.\n\nCVE-2022-4662:\nA flaw incorrect access control in the Linux kernel USB core subsystem was found in the way user attaches usb device. A local user could use this flaw to crash the system.\n\nCVE-2022-47929:\nIn the Linux kernel before 6.1.6, a NULL pointer dereference bug in the traffic control subsystem allows an unprivileged user to trigger a denial of service (system crash) via a crafted traffic control configuration that is set up with \"tc qdisc\" and \"tc class\" commands. This affects qdisc_graft in net/sched/sch_api.c.\n\nCVE-2023-0030:\nA use-after-free flaw was found in the Linux kernel’s nouveau driver in how a user triggers a memory overflow that causes the nvkm_vma_tail function to fail. This flaw allows a local user to crash or potentially escalate their privileges on the system.\n\nCVE-2023-0266:\nA use after free vulnerability exists in the ALSA PCM package in the Linux Kernel. SNDRV_CTL_IOCTL_ELEM_{READ|WRITE}32 is missing locks that can be used in a use-after-free that can result in a priviledge escalation to gain ring0 access from the system user. We recommend upgrading past commit 56b88b50565cd8b946a2d00b0c83927b7ebb055e\n\nCVE-2023-0394:\nA NULL pointer dereference flaw was found in rawv6_push_pending_frames in net/ipv6/raw.c in the network subcomponent in the Linux kernel. This flaw causes the system to crash.\n\nCVE-2023-0461:\nThere is a use-after-free vulnerability in the Linux Kernel which can be exploited to achieve local privilege escalation. To reach the vulnerability kernel configuration flag CONFIG_TLS or CONFIG_XFRM_ESPINTCP has to be configured, but the operation does not require any privilege. There is a use-after-free bug of icsk_ulp_data of a struct inet_connection_sock. When CONFIG_TLS is enabled, user can install a tls context (struct tls_context) on a connected tcp socket. The context is not cleared if this socket is disconnected and reused as a listener. If a new socket is created from the listener, the context is inherited and vulnerable. The setsockopt TCP_ULP operation does not require any privilege. We recommend upgrading past commit 2c02d41d71f90a5168391b6a5f2954112ba2307c\n\nCVE-2023-0590:\nA use-after-free flaw was found in qdisc_graft in net/sched/sch_api.c in the Linux Kernel due to a race problem. This flaw leads to a denial of service issue. If patch ebda44da44f6 (\"net: sched: fix race condition in qdisc_graft()\") not applied yet, then kernel could be affected.\n\nCVE-2023-0597:\nA flaw possibility of memory leak in the Linux kernel cpu_entry_area mapping of X86 CPU data to memory was found in the way user can guess location of exception stack(s) or other important data. A local user could use this flaw to get access to some important data with expected location in memory.\n\nCVE-2023-1074:\nA memory leak flaw was found in the Linux kernel's Stream Control Transmission Protocol. This issue may occur when a user starts a malicious networking service and someone connects to this service. This could allow a local user to starve resources, causing a denial of service.\n\nCVE-2023-1095:\nIn nf_tables_updtable, if nf_tables_table_enable returns an error, nft_trans_destroy is called to free the transaction object. nft_trans_destroy() calls list_del(), but the transaction was never placed on a list -- the list head is all zeroes, this results in a NULL pointer dereference.\n\nCVE-2023-1118:\nA flaw use after free in the Linux kernel integrated infrared receiver/transceiver driver was found in the way user detaching rc device. A local user could use this flaw to crash the system or potentially escalate their privileges on the system.\n\nCVE-2023-1281:\nUse After Free vulnerability in Linux kernel traffic control index filter (tcindex) allows Privilege Escalation. The imperfect hash area can be updated while packets are traversing, which will cause a use-after-free when 'tcf_exts_exec()' is called with the destroyed tcf_ext. A local attacker user can use this vulnerability to elevate its privileges to root. This issue affects Linux Kernel: from 4.14 before git commit ee059170b1f7e94e55fa6cadee544e176a6e59c2.\n\nCVE-2023-1611:\nA use-after-free flaw was found in btrfs_search_slot in fs/btrfs/ctree.c in btrfs in the Linux Kernel.This flaw allows an attacker to crash the system and possibly cause a kernel information lea\n\nCVE-2023-1838:\nA use-after-free flaw was found in vhost_net_set_backend in drivers/vhost/net.c in virtio network subcomponent in the Linux kernel due to a double fget. This flaw could allow a local attacker to crash the system, and could even lead to a kernel information leak problem.\n\nCVE-2023-23454:\ncbq_classify in net/sched/sch_cbq.c in the Linux kernel through 6.1.4 allows attackers to cause a denial of service (slab-out-of-bounds read) because of type confusion (non-negative numbers can sometimes indicate a TC_ACT_SHOT condition rather than valid classification results).\n\nCVE-2023-23455:\natm_tc_enqueue in net/sched/sch_atm.c in the Linux kernel through 6.1.4 allows attackers to cause a denial of service because of type confusion (non-negative numbers can sometimes indicate a TC_ACT_SHOT condition rather than valid classification results).\n\nCVE-2023-23559:\nIn rndis_query_oid in drivers/net/wireless/rndis_wlan.c in the Linux kernel through 6.1.5, there is an integer overflow in an addition.\n\nCVE-2023-26545:\nIn the Linux kernel before 6.1.13, there is a double free in net/mpls/af_mpls.c upon an allocation failure (for registering the sysctl table under a new location) during the renaming of a device.\n\nCVE-2023-28772:\nAn issue was discovered in the Linux kernel before 5.13.3. lib/seq_buf.c has a seq_buf_putmem_hex buffer overflow.",
    "Advisory": {
      "Severity": "Important",
      "Issued": {
        "Date": "2023-05-05"
      },
      "Updated": {
        "Date": "2024-04-22"
      },
      "Cves": [
        {
          "ID": "CVE-2020-14331",
          "CVSS3": "6.6/CVSS:3.1/AV:P/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-14331",
          "CWE": "CWE-787",
          "Public": "20200728"
        },
        {
          "ID": "CVE-2020-25670",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-25670",
          "CWE": "CWE-416",
          "Public": "20201101"
        },
        {
          "ID": "CVE-2020-25671",
          "CVSS3": "0.0/CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:N",
          "Impact": "None",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-25671",
          "CWE": "CWE-416",
          "Public": "20201101"
        },
        {
          "ID": "CVE-2020-25672",
          "CVSS3": "0.0/CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:N",
          "Impact": "None",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-25672",
          "CWE": "CWE-401",
          "Public": "20201101"
        },
        {
          "ID": "CVE-2021-3759",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-3759",
          "CWE": "CWE-770",
          "Public": "20220823"
        },
        {
          "ID": "CVE-2021-3923",
          "CVSS3": "3.3/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N",
          "Impact": "Low",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-3923",
          "CWE": "CWE-200",
          "Public": "20230328"
        },
        {
          "ID": "CVE-2022-1975",
          "CVSS3": "4.5/CVSS:3.1/AV:A/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-1975",
          "CWE": "CWE-248",
          "Public": "20220504"
        },
        {
          "ID": "CVE-2022-20566",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-20566",
          "CWE": "CWE-416-\u003eCWE-667",
          "Public": "20230505"
        },
        {
          "ID": "CVE-2022-2964",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-2964",
          "CWE": "CWE-119",
          "Public": "20230113"
        },
        {
          "ID": "CVE-2022-3107",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3107",
          "CWE": "CWE-476",
          "Public": "20221214"
        },
        {
          "ID": "CVE-2022-3108",
          "CVSS3": "2.5/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:L/A:N",
          "Impact": "Low",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3108",
          "CWE": "CWE-252-\u003eCWE-476",
          "Public": "20221213"
        },
        {
          "ID": "CVE-2022-3111",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3111",
          "CWE": "CWE-401",
          "Public": "20221214"
        },
        {
          "ID": "CVE-2022-3239",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3239",
          "CWE": "CWE-416",
          "Public": "20220919"
        },
        {
          "ID": "CVE-2022-33741",
          "CVSS3": "7.1/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-33741",
          "CWE": "",
          "Public": "20220705"
        },
        {
          "ID": "CVE-2022-3524",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3524",
          "CWE": "CWE-401",
          "Public": "20230110"
        },
        {
          "ID": "CVE-2022-3535",
          "CVSS3": "3.5/CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:L",
          "Impact": "Low",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3535",
          "CWE": "",
          "Public": "20230110"
        },
        {
          "ID": "CVE-2022-3564",
          "CVSS3": "7.1/CVSS:3.1/AV:A/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3564",
          "CWE": "CWE-416",
          "Public": "20230110"
        },
        {
          "ID": "CVE-2022-3566",
          "CVSS3": "4.6/CVSS:3.1/AV:A/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3566",
          "CWE": "CWE-366",
          "Public": "20230110"
        },
        {
          "ID": "CVE-2022-41218",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-41218",
          "CWE": "CWE-416",
          "Public": "20220921"
        },
        {
          "ID": "CVE-2022-4129",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-4129",
          "CWE": "CWE-667-\u003eCWE-362-\u003eCWE-476",
          "Public": "20221129"
        },
        {
          "ID": "CVE-2022-41858",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-41858",
          "CWE": "CWE-416",
          "Public": "20221129"
        },
        {
          "ID": "CVE-2022-42328",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-42328",
          "CWE": "CWE-833",
          "Public": "20221207"
        },
        {
          "ID": "CVE-2022-42703",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-42703",
          "CWE": "CWE-416",
          "Public": "20221009"
        },
        {
          "ID": "CVE-2022-42896",
          "CVSS3": "6.8/CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-42896",
          "CWE": "CWE-416",
          "Public": "20230110"
        },
        {
          "ID": "CVE-2022-45934",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-45934",
          "CWE": "CWE-190",
          "Public": "20221127"
        },
        {
          "ID": "CVE-2022-4662",
          "CVSS3": "5.1/CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-4662",
          "CWE": "CWE-455",
          "Public": "20230428"
        },
        {
          "ID": "CVE-2022-47929",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-47929",
          "CWE": "CWE-476",
          "Public": "20230118"
        },
        {
          "ID": "CVE-2023-0030",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0030",
          "CWE": "CWE-416",
          "Public": "20230105"
        },
        {
          "ID": "CVE-2023-0266",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0266",
          "CWE": "CWE-416",
          "Public": "20230113"
        },
        {
          "ID": "CVE-2023-0394",
          "CVSS3": "6.5/CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0394",
          "CWE": "CWE-476",
          "Public": "20230127"
        },
        {
          "ID": "CVE-2023-0461",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0461",
          "CWE": "CWE-416",
          "Public": "20230228"
        },
        {
          "ID": "CVE-2023-0590",
          "CVSS3": "6.5/CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0590",
          "CWE": "CWE-416",
          "Public": "20230201"
        },
        {
          "ID": "CVE-2023-0597",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0597",
          "CWE": "CWE-401",
          "Public": "20230201"
        },
        {
          "ID": "CVE-2023-1074",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1074",
          "CWE": "CWE-401",
          "Public": "20230301"
        },
        {
          "ID": "CVE-2023-1095",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1095",
          "CWE": "CWE-476",
          "Public": "20230228"
        },
        {
          "ID": "CVE-2023-1118",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1118",
          "CWE": "CWE-416",
          "Public": "20230303"
        },
        {
          "ID": "CVE-2023-1281",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1281",
          "CWE": "CWE-416",
          "Public": "20230322"
        },
        {
          "ID": "CVE-2023-1611",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1611",
          "CWE": "CWE-416",
          "Public": "20230403"
        },
        {
          "ID": "CVE-2023-1838",
          "CVSS3": "7.1/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1838",
          "CWE": "CWE-416",
          "Public": "20230406"
        },
        {
          "ID": "CVE-2023-23454",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-23454",
          "CWE": "CWE-125",
          "Public": "20230112"
        },
        {
          "ID": "CVE-2023-23455",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-23455",
          "CWE": "CWE-843",
          "Public": "20230112"
        },
        {
          "ID": "CVE-2023-23559",
          "CVSS3": "6.5/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-23559",
          "CWE": "CWE-190",
          "Public": "20230113"
        },
        {
          "ID": "CVE-2023-26545",
          "CVSS3": "6.2/CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-26545",
          "CWE": "CWE-415",
          "Public": "20230225"
        },
        {
          "ID": "CVE-2023-28772",
          "CVSS3": "7.4/CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-28772",
          "CWE": "CWE-119",
          "Public": "20230323"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:7:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "bpftool is earlier than 0:4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143001"
          },
          {
            "Comment": "kernel is earlier than 0:4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143002"
          },
          {
            "Comment": "kernel-debug is earlier than 0:debug-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143003"
          },
          {
            "Comment": "kernel-debug-devel is earlier than 0:debug-devel-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143004"
          },
          {
            "Comment": "kernel-devel is earlier than 0:devel-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143005"
          },
          {
            "Comment": "kernel-headers is earlier than 0:headers-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143006"
          },
          {
            "Comment": "kernel-tools is earlier than 0:tools-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143007"
          },
          {
            "Comment": "kernel-tools-libs is earlier than 0:tools-libs-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143008"
          },
          {
            "Comment": "kernel-tools-libs-devel is earlier than 0:tools-libs-devel-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143009"
          },
          {
            "Comment": "perf is earlier than 0:4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143010"
          },
          {
            "Comment": "python-perf is earlier than 0:perf-4.19.91-27.2.an7",
            "TestRef": "oval:cn.openanolis:tst:20230143011"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 7 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}