{
  "ID": "oval:cn.openanolis:def:20240066",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2024:0066: java-17-openjdk security and bug fix update (Important)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 8"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2024:0066",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2024:0066",
        "Source": "ANSA"
      }
    ],
    "Description": "Package updates are available for Anolis 8 that fix the following vulnerabilities:\n\nCVE-2024-20918:\nDifficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data as well as unauthorized access to critical data or complete access to all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability can be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. This vulnerability also applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security.\n\nCVE-2024-20919:\nDifficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability can only be exploited by supplying data to APIs in the specified Component without using Untrusted Java Web Start applications or Untrusted Java applets, such as through a web service.\n\nCVE-2024-20921:\nDifficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized access to critical data or complete access to all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability can be exploited by using APIs in the specified Component, e.g., through a web service which supplies data to the APIs. This vulnerability also applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security.\n\nCVE-2024-20932:\nEasily exploitable vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator).\n\nCVE-2024-20945:\nDifficult to exploit vulnerability allows low privileged attacker with logon to the infrastructure where Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition executes to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized access to critical data or complete access to all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator).\n\nCVE-2024-20952:\nDifficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data as well as unauthorized access to critical data or complete access to all Oracle Java SE, Oracle GraalVM for JDK, Oracle GraalVM Enterprise Edition accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets, that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g., code installed by an administrator).",
    "Advisory": {
      "Severity": "Important",
      "Issued": {
        "Date": "2024-02-26"
      },
      "Updated": {
        "Date": "2024-02-26"
      },
      "Cves": [
        {
          "ID": "CVE-2024-20918",
          "CVSS3": "7.4/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20918",
          "CWE": "CWE-190-\u003e(CWE-125|CWE-787)",
          "Public": "20240116"
        },
        {
          "ID": "CVE-2024-20919",
          "CVSS3": "5.9/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:H/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20919",
          "CWE": "CWE-20",
          "Public": "20240116"
        },
        {
          "ID": "CVE-2024-20921",
          "CVSS3": "5.9/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20921",
          "CWE": "CWE-20",
          "Public": "20240116"
        },
        {
          "ID": "CVE-2024-20932",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20932",
          "CWE": "CWE-20",
          "Public": "20240116"
        },
        {
          "ID": "CVE-2024-20945",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20945",
          "CWE": "CWE-532",
          "Public": "20240116"
        },
        {
          "ID": "CVE-2024-20952",
          "CVSS3": "7.4/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-20952",
          "CWE": "CWE-385",
          "Public": "20240116"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:8:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "java-17-openjdk is earlier than 1:17-openjdk-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066001"
          },
          {
            "Comment": "java-17-openjdk-demo is earlier than 1:17-openjdk-demo-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066002"
          },
          {
            "Comment": "java-17-openjdk-devel is earlier than 1:17-openjdk-devel-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066003"
          },
          {
            "Comment": "java-17-openjdk-headless is earlier than 1:17-openjdk-headless-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066004"
          },
          {
            "Comment": "java-17-openjdk-javadoc is earlier than 1:17-openjdk-javadoc-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066005"
          },
          {
            "Comment": "java-17-openjdk-javadoc-zip is earlier than 1:17-openjdk-javadoc-zip-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066006"
          },
          {
            "Comment": "java-17-openjdk-jmods is earlier than 1:17-openjdk-jmods-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066007"
          },
          {
            "Comment": "java-17-openjdk-src is earlier than 1:17-openjdk-src-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066008"
          },
          {
            "Comment": "java-17-openjdk-static-libs is earlier than 1:17-openjdk-static-libs-17.0.10.0.7-2.0.1.an8",
            "TestRef": "oval:cn.openanolis:tst:20240066009"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 8 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}