{
  "ID": "oval:cn.openanolis:def:20220074",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2022:0074: openssl security update (Moderate)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 7"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2022:0074",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2022:0074",
        "Source": "ANSA"
      }
    ],
    "Description": "Package updates are available for Anolis 7 that fix the following vulnerabilities:\n\nCVE-2021-3712:\nASN.1 strings are represented internally within OpenSSL as an ASN1_STRING structure which contains a buffer holding the string data and a field holding the buffer length. This contrasts with normal C strings which are repesented as a buffer for the string data which is terminated with a NUL (0) byte. Although not a strict requirement, ASN.1 strings that are parsed using OpenSSL's own \"d2i\" functions (and other similar parsing functions) as well as any string whose value has been set with the ASN1_STRING_set() function will additionally NUL terminate the byte array in the ASN1_STRING structure. However, it is possible for applications to directly construct valid ASN1_STRING structures which do not NUL terminate the byte array by directly setting the \"data\" and \"length\" fields in the ASN1_STRING array. This can also happen by using the ASN1_STRING_set0() function. Numerous OpenSSL functions that print ASN.1 data have been found to assume that the ASN1_STRING byte array will be NUL terminated, even though this is not guaranteed for strings that have been directly constructed. Where an application requests an ASN.1 structure to be printed, and where that ASN.1 structure contains ASN1_STRINGs that have been directly constructed by the application without NUL terminating the \"data\" field, then a read buffer overrun can occur. The same thing can also occur during name constraints processing of certificates (for example if a certificate has been directly constructed by the application instead of loading it via the OpenSSL parsing functions, and the certificate contains non NUL terminated ASN1_STRING structures). It can also occur in the X509_get1_email(), X509_REQ_get1_email() and X509_get1_ocsp() functions. If a malicious actor can cause an application to directly construct an ASN1_STRING and then process it through one of the affected OpenSSL functions then this issue could be hit. This might result in a crash (causing a Denial of Service attack). It could also result in the disclosure of private memory contents (such as private keys, or sensitive plaintext). Fixed in OpenSSL 1.1.1l (Affected 1.1.1-1.1.1k). Fixed in OpenSSL 1.0.2za (Affected 1.0.2-1.0.2y).",
    "Advisory": {
      "Severity": "Moderate",
      "Issued": {
        "Date": "2022-03-15"
      },
      "Updated": {
        "Date": "2022-04-02"
      },
      "Cves": [
        {
          "ID": "CVE-2021-3712",
          "CVSS3": "7.4/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-3712",
          "CWE": "CWE-125",
          "Public": "20211223"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:7:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "openssl is earlier than 1:1.0.2k-23.an7",
            "TestRef": "oval:cn.openanolis:tst:20220074001"
          },
          {
            "Comment": "openssl-devel is earlier than 1:devel-1.0.2k-23.an7",
            "TestRef": "oval:cn.openanolis:tst:20220074002"
          },
          {
            "Comment": "openssl-libs is earlier than 1:libs-1.0.2k-23.an7",
            "TestRef": "oval:cn.openanolis:tst:20220074003"
          },
          {
            "Comment": "openssl-perl is earlier than 1:perl-1.0.2k-23.an7",
            "TestRef": "oval:cn.openanolis:tst:20220074004"
          },
          {
            "Comment": "openssl-static is earlier than 1:static-1.0.2k-23.an7",
            "TestRef": "oval:cn.openanolis:tst:20220074005"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 7 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}