{
  "ID": "oval:cn.openanolis:def:20240436",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2024:0436: buildkit security update (Important)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 23"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2024:0436",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2024:0436",
        "Source": "ANSA"
      }
    ],
    "Description": "Package updates are available for Anolis 23 that fix the following vulnerabilities:\n\nCVE-2023-26054:\nBuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. In affected versions when the user sends a build request that contains a Git URL that contains credentials and the build creates a provenance attestation describing that build, these credentials could be visible from the provenance attestation. Git URL can be passed in two ways: 1) Invoking build directly from a URL with credentials. 2) If the client sends additional version control system (VCS) info hint parameters on builds from a local source. Usually, that would mean reading the origin URL from `.git/config` file. When a build is performed under specific conditions where credentials were passed to BuildKit they may be visible to everyone who has access to provenance attestation. Provenance attestations and VCS info hints were added in version v0.11.0. Previous versions are not vulnerable. In v0.10, when building directly from Git URL, the same URL could be visible in `BuildInfo` structure that is a predecessor of Provenance attestations. Previous versions are not vulnerable. This bug has been fixed in v0.11.4. Users are advised to upgrade. Users unable to upgrade may disable VCS info hints by setting `BUILDX_GIT_INFO=0`. `buildctl` does not set VCS hints based on `.git` directory, and values would need to be passed manually with `--opt`.\n\nCVE-2024-23650:\nBuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. A malicious BuildKit client or frontend could craft a request that could lead to BuildKit daemon crashing with a panic. The issue has been fixed in v0.12.5. As a workaround, avoid using BuildKit frontends from untrusted sources.\n\nCVE-2024-23651:\nBuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. Two malicious build steps running in parallel sharing the same cache mounts with subpaths could cause a race condition that can lead to files from the host system being accessible to the build container. The issue has been fixed in v0.12.5. Workarounds include, avoiding using BuildKit frontend from an untrusted source or building an untrusted Dockerfile containing cache mounts with --mount=type=cache,source=... options.\n\nCVE-2024-23652:\nBuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. A malicious BuildKit frontend or Dockerfile using RUN --mount could trick the feature that removes empty files created for the mountpoints into removing a file outside the container, from the host system. The issue has been fixed in v0.12.5. Workarounds include avoiding using BuildKit frontends from an untrusted source or building an untrusted Dockerfile containing RUN --mount feature.\n\nCVE-2024-23653:\nBuildKit is a toolkit for converting source code to build artifacts in an efficient, expressive and repeatable manner. In addition to running containers as build steps, BuildKit also provides APIs for running interactive containers based on built images. It was possible to use these APIs to ask BuildKit to run a container with elevated privileges. Normally, running such containers is only allowed if special `security.insecure` entitlement is enabled both by buildkitd configuration and allowed by the user initializing the build request. The issue has been fixed in v0.12.5 . Avoid using BuildKit frontends from untrusted sources.",
    "Advisory": {
      "Severity": "Important",
      "Issued": {
        "Date": "2024-06-05"
      },
      "Updated": {
        "Date": "2024-06-06"
      },
      "Cves": [
        {
          "ID": "CVE-2023-26054",
          "CVSS3": "6.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-26054",
          "CWE": "CWE-200",
          "Public": "20240605"
        },
        {
          "ID": "CVE-2024-23650",
          "CVSS3": "5.3/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-23650",
          "CWE": "CWE-754",
          "Public": "20240603"
        },
        {
          "ID": "CVE-2024-23651",
          "CVSS3": "7.5/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:H/A:N",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-23651",
          "CWE": "CWE-362",
          "Public": "20240605"
        },
        {
          "ID": "CVE-2024-23652",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-23652",
          "CWE": "CWE-22",
          "Public": "20240605"
        },
        {
          "ID": "CVE-2024-23653",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-23653",
          "CWE": "CWE-863",
          "Public": "20240605"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:23:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "buildkit is earlier than 0:0.13.2-1.an23",
            "TestRef": "oval:cn.openanolis:tst:20240436001"
          },
          {
            "Comment": "buildkit-doc is earlier than 0:doc-0.13.2-1.an23",
            "TestRef": "oval:cn.openanolis:tst:20240436002"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 23 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}