{
  "ID": "oval:cn.openanolis:def:20240554",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2024:0554: ANSA: kernel security and bug fix update: kernel-5.10.134-17 (Important)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 23"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2024:0554",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2024:0554",
        "Source": "ANSA"
      }
    ],
    "Description": "Package updates are available for Anolis 23 that fix the following vulnerabilities:\n\nCVE-2022-3114:\nAn issue was discovered in the Linux kernel through 5.16-rc6. imx_register_uart_clocks in drivers/clk/imx/clk.c lacks check of the return value of kcalloc() and will cause the null pointer dereference.\n\nCVE-2022-3424:\nA use-after-free flaw was found in the Linux kernel’s SGI GRU driver in the way the first gru_file_unlocked_ioctl function is called by the user, where a fail pass occurs in the gru_check_chiplet_assignment function. This flaw allows a local user to crash or potentially escalate their privileges on the system.\n\nCVE-2022-38096:\nA NULL pointer dereference vulnerability was found in vmwgfx driver in drivers/gpu/vmxgfx/vmxgfx_execbuf.c in GPU component of Linux kernel with device file '/dev/dri/renderD128 (or Dxxx)'. This flaw allows a local attacker with a user account on the system to gain privilege, causing a denial of service(DoS).\n\nCVE-2022-3903:\nAn incorrect read request flaw was found in the Infrared Transceiver USB driver in the Linux kernel. This issue occurs when a user attaches a malicious USB device. A local user could use this flaw to starve the resources, causing denial of service or potentially crashing the system.\n\nCVE-2022-45887:\nAn issue was discovered in the Linux kernel through 6.0.9. drivers/media/usb/ttusb-dec/ttusb_dec.c has a memory leak because of the lack of a dvb_frontend_detach call.\n\nCVE-2023-0160:\nA deadlock flaw was found in the Linux kernel’s BPF subsystem. This flaw allows a local user to potentially crash the system.\n\nCVE-2023-0615:\nA memory leak flaw and potential divide by zero and Integer overflow was found in the Linux kernel V4L2 and vivid test code functionality. This issue occurs when a user triggers ioctls, such as VIDIOC_S_DV_TIMINGS ioctl. This could allow a local user to crash the system if vivid test code enabled.\n\nCVE-2023-1206:\nA hash collision flaw was found in the IPv6 connection lookup table in the Linux kernel’s IPv6 functionality when a user makes a new kind of SYN flood attack. A user located in the local network or with a high bandwidth connection can increase the CPU usage of the server that accepts IPV6 connections up to 95%.\n\nCVE-2023-20569:\nA side channel vulnerability on some of the AMD CPUs may allow an attacker to influence the return address prediction. This may result in speculative execution at an attacker-controlled address, potentially leading to information disclosure.\n\nCVE-2023-20588:\nA division-by-zero error on some AMD processors can potentially return speculative data resulting in loss of confidentiality. \n\nCVE-2023-20593:\nAn issue in “Zen 2” CPUs, under specific microarchitectural circumstances, may allow an attacker to potentially access sensitive information.\n\nCVE-2023-28464:\nhci_conn_cleanup in net/bluetooth/hci_conn.c in the Linux kernel through 6.2.9 has a use-after-free (observed in hci_conn_hash_flush) because of calls to hci_dev_put and hci_conn_put. There is a double free that may lead to privilege escalation.\n\nCVE-2023-2860:\nAn out-of-bounds read vulnerability was found in the SR-IPv6 implementation in the Linux kernel. The flaw exists within the processing of seg6 attributes. The issue results from the improper validation of user-supplied data, which can result in a read past the end of an allocated buffer. This flaw allows a privileged local user to disclose sensitive information on affected installations of the Linux kernel.\n\nCVE-2023-3006:\nA known cache speculation vulnerability, known as Branch History Injection (BHI) or Spectre-BHB, becomes actual again for the new hw AmpereOne. Spectre-BHB is similar to Spectre v2, except that malicious code uses the shared branch history (stored in the CPU Branch History Buffer, or BHB) to influence mispredicted branches within the victim's hardware context. Once that occurs, speculation caused by the mispredicted branches can cause cache allocation. This issue leads to obtaining information that should not be accessible.\n\nCVE-2023-31083:\nAn issue was discovered in drivers/bluetooth/hci_ldisc.c in the Linux kernel 6.2. In hci_uart_tty_ioctl, there is a race condition between HCIUARTSETPROTO and HCIUARTGETPROTO. HCI_UART_PROTO_SET is set before hu-\u003eproto is set. A NULL pointer dereference may occur.\n\nCVE-2023-31085:\nAn issue was discovered in drivers/mtd/ubi/cdev.c in the Linux kernel 6.2. There is a divide-by-zero error in do_div(sz,mtd-\u003eerasesize), used indirectly by ctrl_cdev_ioctl, when mtd-\u003eerasesize is 0.\n\nCVE-2023-3358:\nA null pointer dereference was found in the Linux kernel's Integrated Sensor Hub (ISH) driver. This issue could allow a local user to crash the system.\n\nCVE-2023-3567:\nA use-after-free flaw was found in vcs_read in drivers/tty/vt/vc_screen.c in vc_screen in the Linux Kernel. This issue may allow an attacker with local user access to cause a system crash or leak internal kernel information.\n\nCVE-2023-3772:\nA flaw was found in the Linux kernel’s IP framework for transforming packets (XFRM subsystem). This issue may allow a malicious user with CAP_NET_ADMIN privileges to directly dereference a NULL pointer in xfrm_update_ae_params(), leading to a possible kernel crash and denial of service.\n\nCVE-2023-3863:\nA use-after-free flaw was found in nfc_llcp_find_local in net/nfc/llcp_core.c in NFC in the Linux kernel. This flaw allows a local user with special privileges to impact a kernel information leak issue.\n\nCVE-2023-39192:\nA flaw was found in the Netfilter subsystem in the Linux kernel. The xt_u32 module did not validate the fields in the xt_u32 structure. This flaw allows a local privileged attacker to trigger an out-of-bounds read by setting the size fields with a value beyond the array boundaries, leading to a crash or information disclosure.\n\nCVE-2023-4015:\nA use-after-free vulnerability in the Linux kernel's netfilter: nf_tables component can be exploited to achieve local privilege escalation.\nOn an error when building a nftables rule, deactivating immediate expressions in nft_immediate_deactivate() can lead unbinding the chain and objects be deactivated but later used.\nWe recommend upgrading past commit 0a771f7b266b02d262900c75f1e175c7fe76fec2.\n\nCVE-2023-4132:\nA use-after-free vulnerability was found in the siano smsusb module in the Linux kernel. The bug occurs during device initialization when the siano device is plugged in. This flaw allows a local user to crash the system, causing a denial of service condition.\n\nCVE-2023-4155:\nA flaw was found in KVM AMD Secure Encrypted Virtualization (SEV) in the Linux kernel. A KVM guest using SEV-ES or SEV-SNP with multiple vCPUs can trigger a double fetch race condition vulnerability and invoke the `VMGEXIT` handler recursively. If an attacker manages to call the handler multiple times, they can trigger a stack overflow and cause a denial of service or potentially guest-to-host escape in kernel configurations without stack guard pages (`CONFIG_VMAP_STACK`).\n\nCVE-2023-42753:\nAn array indexing vulnerability was found in the netfilter subsystem of the Linux kernel. A missing macro could lead to a miscalculation of the `h-\u003enets` array offset, providing attackers with the primitive to arbitrarily increment/decrement a memory buffer out-of-bound. This issue may allow a local user to crash the system or potentially escalate their privileges on the system.\n\nCVE-2023-42754:\nA NULL pointer dereference flaw was found in the Linux kernel ipv4 stack. The socket buffer (skb) was assumed to be associated with a device before calling __ip_options_compile, which is not always the case if the skb is re-routed by ipvs. This issue may allow a local user with CAP_NET_ADMIN privileges to crash the system.\n\nCVE-2023-42755:\nA flaw was found in the IPv4 Resource Reservation Protocol (RSVP) classifier in the Linux kernel. The xprt pointer may go beyond the linear part of the skb, leading to an out-of-bounds read in the `rsvp_classify` function. This issue may allow a local user to crash the system and cause a denial of service.\n\nCVE-2023-45863:\nAn issue was discovered in lib/kobject.c in the Linux kernel before 6.2.3. With root access, an attacker can trigger a race condition that results in a fill_kobj_path out-of-bounds write.\n\nCVE-2023-45871:\nAn issue was discovered in drivers/net/ethernet/intel/igb/igb_main.c in the IGB driver in the Linux kernel before 6.5.3. A buffer size may not be adequate for frames larger than the MTU.\n\nCVE-2023-4622:\nA use-after-free vulnerability in the Linux kernel's af_unix component can be exploited to achieve local privilege escalation.\nThe unix_stream_sendpage() function tries to add data to the last skb in the peer's recv queue without locking the queue. Thus there is a race where unix_stream_sendpage() could access an skb locklessly that is being released by garbage collection, resulting in use-after-free.\nWe recommend upgrading past commit 790c2f9d15b594350ae9bca7b236f2b1859de02c.\n\nCVE-2023-4623:\nA use-after-free vulnerability in the Linux kernel's net/sched: sch_hfsc (HFSC qdisc traffic control) component can be exploited to achieve local privilege escalation.\nIf a class with a link-sharing curve (i.e. with the HFSC_FSC flag set) has a parent without a link-sharing curve, then init_vf() will call vttree_insert() on the parent, but vttree_remove() will be skipped in update_vf(). This leaves a dangling pointer that can cause a use-after-free.\nWe recommend upgrading past commit b3d26c5702c7d6c45456326e56d2ccf3f103e60f.\n\nCVE-2023-4921:\nA use-after-free vulnerability in the Linux kernel's net/sched: sch_qfq component can be exploited to achieve local privilege escalation.\nWhen the plug qdisc is used as a class of the qfq qdisc, sending network packets triggers use-after-free in qfq_dequeue() due to the incorrect .peek handler of sch_plug and lack of error checking in agg_dequeue().\nWe recommend upgrading past commit 8fc134fee27f2263988ae38920bc03da416b03d8.\n\nCVE-2023-51042:\nIn the Linux kernel before 6.4.12, amdgpu_cs_wait_all_fences in drivers/gpu/drm/amd/amdgpu/amdgpu_cs.c has a fence use-after-free.\n\nCVE-2023-51779:\nbt_sock_recvmsg in net/bluetooth/af_bluetooth.c in the Linux kernel through 6.6.8 has a use-after-free because of a bt_sock_ioctl race condition.\n\nCVE-2023-5178:\nA use-after-free vulnerability was found in drivers/nvme/target/tcp.c` in `nvmet_tcp_free_crypto` due to a logical bug in the NVMe/TCP subsystem in the Linux kernel. This issue may allow a malicious user to cause a use-after-free and double-free problem, which may permit remote code execution or lead to local privilege escalation.\n\nCVE-2023-52438:\nIn the Linux kernel, the following vulnerability has been resolved:\nbinder: fix use-after-free in shinker's callback\nThe mmap read lock is used during the shrinker's callback, which means\nthat using alloc-\u003evma pointer isn't safe as it can race with munmap().\nAs of commit dd2283f2605e (\"mm: mmap: zap pages with read mmap_sem in\nmunmap\") the mmap lock is downgraded after the vma has been isolated.\nI was able to reproduce this issue by manually adding some delays and\ntriggering page reclaiming through the shrinker's debug sysfs. The\nfollowing KASAN report confirms the UAF:\n==================================================================\nBUG: KASAN: slab-use-after-free in zap_page_range_single+0x470/0x4b8\nRead of size 8 at addr ffff356ed50e50f0 by task bash/478\nCPU: 1 PID: 478 Comm: bash Not tainted 6.6.0-rc5-00055-g1c8b86a3799f-dirty #70\nHardware name: linux,dummy-virt (DT)\nCall trace:\nzap_page_range_single+0x470/0x4b8\nbinder_alloc_free_page+0x608/0xadc\n__list_lru_walk_one+0x130/0x3b0\nlist_lru_walk_node+0xc4/0x22c\nbinder_shrink_scan+0x108/0x1dc\nshrinker_debugfs_scan_write+0x2b4/0x500\nfull_proxy_write+0xd4/0x140\nvfs_write+0x1ac/0x758\nksys_write+0xf0/0x1dc\n__arm64_sys_write+0x6c/0x9c\nAllocated by task 492:\nkmem_cache_alloc+0x130/0x368\nvm_area_alloc+0x2c/0x190\nmmap_region+0x258/0x18bc\ndo_mmap+0x694/0xa60\nvm_mmap_pgoff+0x170/0x29c\nksys_mmap_pgoff+0x290/0x3a0\n__arm64_sys_mmap+0xcc/0x144\nFreed by task 491:\nkmem_cache_free+0x17c/0x3c8\nvm_area_free_rcu_cb+0x74/0x98\nrcu_core+0xa38/0x26d4\nrcu_core_si+0x10/0x1c\n__do_softirq+0x2fc/0xd24\nLast potentially related work creation:\n__call_rcu_common.constprop.0+0x6c/0xba0\ncall_rcu+0x10/0x1c\nvm_area_free+0x18/0x24\nremove_vma+0xe4/0x118\ndo_vmi_align_munmap.isra.0+0x718/0xb5c\ndo_vmi_munmap+0xdc/0x1fc\n__vm_munmap+0x10c/0x278\n__arm64_sys_munmap+0x58/0x7c\nFix this issue by performing instead a vma_lookup() which will fail to\nfind the vma that was isolated before the mmap lock downgrade. Note that\nthis option has better performance than upgrading to a mmap write lock\nwhich would increase contention. Plus, mmap_write_trylock() has been\nrecently removed anyway.\n\nCVE-2023-52445:\nIn the Linux kernel, the following vulnerability has been resolved:\nmedia: pvrusb2: fix use after free on context disconnection\nUpon module load, a kthread is created targeting the\npvr2_context_thread_func function, which may call pvr2_context_destroy\nand thus call kfree() on the context object. However, that might happen\nbefore the usb hub_event handler is able to notify the driver. This\npatch adds a sanity check before the invalid read reported by syzbot,\nwithin the context disconnection call stack.\n\nCVE-2023-5717:\nA heap out-of-bounds write vulnerability in the Linux kernel's Linux Kernel Performance Events (perf) component can be exploited to achieve local privilege escalation.\nIf perf_read_group() is called while an event's sibling_list is smaller than its child's sibling_list, it can increment or write to memory locations outside of the allocated buffer.\nWe recommend upgrading past commit 32671e3799ca2e4590773fd0e63aaa4229e50c06.\n\nCVE-2023-6176:\nA null pointer dereference flaw was found in the Linux kernel API for the cryptographic algorithm scatterwalk functionality. This issue occurs when a user constructs a malicious packet with specific socket configuration, which could allow a local user to crash the system or escalate their privileges on the system.\n\nCVE-2023-6546:\nA race condition was found in the GSM 0710 tty multiplexor in the Linux kernel. This issue occurs when two threads execute the GSMIOC_SETCONF ioctl on the same tty file descriptor with the gsm line discipline enabled, and can lead to a use-after-free problem on a struct gsm_dlci while restarting the gsm mux. This could allow a local unprivileged user to escalate their privileges on the system.\n\nCVE-2023-6817:\nA use-after-free vulnerability in the Linux kernel's netfilter: nf_tables component can be exploited to achieve local privilege escalation.\nThe function nft_pipapo_walk did not skip inactive elements during set walk which could lead double deactivations of PIPAPO (Pile Packet Policies) elements, leading to use-after-free.\nWe recommend upgrading past commit 317eb9685095678f2c9f5a8189de698c5354316a.\n\nCVE-2023-6915:\nA Null pointer dereference problem was found in ida_free in lib/idr.c in the Linux Kernel. This issue may allow an attacker using this library to cause a denial of service problem due to a missing check at a function return.\n\nCVE-2023-6931:\nA heap out-of-bounds write vulnerability in the Linux kernel's Performance Events system component can be exploited to achieve local privilege escalation.\nA perf_event's read_size can overflow, leading to an heap out-of-bounds increment or write in perf_read_group().\nWe recommend upgrading past commit 382c27f4ed28f803b1f1473ac2d8db0afc795a1b.\n\nCVE-2023-6932:\nA use-after-free vulnerability in the Linux kernel's ipv4: igmp component can be exploited to achieve local privilege escalation.\nA race condition can be exploited to cause a timer be mistakenly registered on a RCU read locked object which is freed by another thread.\nWe recommend upgrading past commit e2b706c691905fe78468c361aaabc719d0a496f1.\n\nCVE-2024-0565:\nAn out-of-bounds memory read flaw was found in receive_encrypted_standard in fs/smb/client/smb2ops.c in the SMB Client sub-component in the Linux Kernel. This issue occurs due to integer underflow on the memcpy length, leading to a denial of service.\n\nCVE-2024-0646:\nAn out-of-bounds memory write flaw was found in the Linux kernel’s Transport Layer Security functionality in how a user calls a function splice with a ktls socket as the destination. This flaw allows a local user to crash or potentially escalate their privileges on the system.\n\nCVE-2024-1086:\nA use-after-free vulnerability in the Linux kernel's netfilter: nf_tables component can be exploited to achieve local privilege escalation.\nThe nft_verdict_init() function allows positive values as drop error within the hook verdict, and hence the nf_hook_slow() function can cause a double free vulnerability when NF_DROP is issued with a drop error which resembles NF_ACCEPT.\nWe recommend upgrading past commit f342de4e2f33e0e39165d8639387aa6c19dff660.\n\nCVE-2024-22099:\nNULL Pointer Dereference vulnerability in Linux Linux kernel kernel on Linux, x86, ARM (net, bluetooth modules) allows Overflow Buffers. This vulnerability is associated with program files /net/bluetooth/rfcomm/core.C.\nThis issue affects Linux kernel: v2.6.12-rc2.\n\nCVE-2024-23307:\nInteger Overflow or Wraparound vulnerability in Linux Linux kernel kernel on Linux, x86, ARM (md, raid, raid5 modules) allows Forced Integer Overflow.\n\nCVE-2024-24855:\nA race condition was found in the Linux kernel's scsi device driver in lpfc_unregister_fcf_rescan() function. This can result in a null pointer dereference issue, possibly leading to a kernel panic or denial of service issue.\n\nCVE-2024-24860:\nA race condition was found in the Linux kernel's bluetooth device driver in {min,max}_key_size_set() function. This can result in a null pointer dereference issue, possibly leading to a kernel panic or denial of service issue.\n\nCVE-2024-26589:\nIn the Linux kernel, the following vulnerability has been resolved:\nbpf: Reject variable offset alu on PTR_TO_FLOW_KEYS\nFor PTR_TO_FLOW_KEYS, check_flow_keys_access() only uses fixed off\nfor validation. However, variable offset ptr alu is not prohibited\nfor this ptr kind. So the variable offset is not checked.\nThe following prog is accepted:\nfunc#0 @0\n0: R1=ctx() R10=fp0\n0: (bf) r6 = r1                       ; R1=ctx() R6_w=ctx()\n1: (79) r7 = *(u64 *)(r6 +144)        ; R6_w=ctx() R7_w=flow_keys()\n2: (b7) r8 = 1024                     ; R8_w=1024\n3: (37) r8 /= 1                       ; R8_w=scalar()\n4: (57) r8 \u0026= 1024                    ; R8_w=scalar(smin=smin32=0,\nsmax=umax=smax32=umax32=1024,var_off=(0x0; 0x400))\n5: (0f) r7 += r8\nmark_precise: frame0: last_idx 5 first_idx 0 subseq_idx -1\nmark_precise: frame0: regs=r8 stack= before 4: (57) r8 \u0026= 1024\nmark_precise: frame0: regs=r8 stack= before 3: (37) r8 /= 1\nmark_precise: frame0: regs=r8 stack= before 2: (b7) r8 = 1024\n6: R7_w=flow_keys(smin=smin32=0,smax=umax=smax32=umax32=1024,var_off\n=(0x0; 0x400)) R8_w=scalar(smin=smin32=0,smax=umax=smax32=umax32=1024,\nvar_off=(0x0; 0x400))\n6: (79) r0 = *(u64 *)(r7 +0)          ; R0_w=scalar()\n7: (95) exit\nThis prog loads flow_keys to r7, and adds the variable offset r8\nto r7, and finally causes out-of-bounds access:\nBUG: unable to handle page fault for address: ffffc90014c80038\n[...]\nCall Trace:\n\u003cTASK\u003e\nbpf_dispatcher_nop_func include/linux/bpf.h:1231 [inline]\n__bpf_prog_run include/linux/filter.h:651 [inline]\nbpf_prog_run include/linux/filter.h:658 [inline]\nbpf_prog_run_pin_on_cpu include/linux/filter.h:675 [inline]\nbpf_flow_dissect+0x15f/0x350 net/core/flow_dissector.c:991\nbpf_prog_test_run_flow_dissector+0x39d/0x620 net/bpf/test_run.c:1359\nbpf_prog_test_run kernel/bpf/syscall.c:4107 [inline]\n__sys_bpf+0xf8f/0x4560 kernel/bpf/syscall.c:5475\n__do_sys_bpf kernel/bpf/syscall.c:5561 [inline]\n__se_sys_bpf kernel/bpf/syscall.c:5559 [inline]\n__x64_sys_bpf+0x73/0xb0 kernel/bpf/syscall.c:5559\ndo_syscall_x64 arch/x86/entry/common.c:52 [inline]\ndo_syscall_64+0x3f/0x110 arch/x86/entry/common.c:83\nentry_SYSCALL_64_after_hwframe+0x63/0x6b\nFix this by rejecting ptr alu with variable offset on flow_keys.\nApplying the patch rejects the program with \"R7 pointer arithmetic\non flow_keys prohibited\".\n\nCVE-2024-26597:\nlinux内核的rmnet存在全局变量越界读，影响版本4.17-rc1\u003c=版本\u003c6.8-rc1，包含4.19和5.10",
    "Advisory": {
      "Severity": "Important",
      "Issued": {
        "Date": "2024-07-01"
      },
      "Updated": {
        "Date": "2024-07-01"
      },
      "Cves": [
        {
          "ID": "CVE-2022-3114",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3114",
          "CWE": "CWE-476",
          "Public": "20221213"
        },
        {
          "ID": "CVE-2022-3424",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3424",
          "CWE": "CWE-416",
          "Public": "20220919"
        },
        {
          "ID": "CVE-2022-38096",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-38096",
          "CWE": "CWE-476",
          "Public": "20220909"
        },
        {
          "ID": "CVE-2022-3903",
          "CVSS3": "4.6/CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-3903",
          "CWE": "CWE-843",
          "Public": "20221114"
        },
        {
          "ID": "CVE-2022-45887",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-45887",
          "CWE": "CWE-401",
          "Public": "20221115"
        },
        {
          "ID": "CVE-2023-0160",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0160",
          "CWE": "CWE-833",
          "Public": "20230312"
        },
        {
          "ID": "CVE-2023-0615",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-0615",
          "CWE": "(CWE-190|CWE-369|CWE-401)",
          "Public": "20230202"
        },
        {
          "ID": "CVE-2023-1206",
          "CVSS3": "5.7/CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-1206",
          "CWE": "CWE-400",
          "Public": "20230624"
        },
        {
          "ID": "CVE-2023-20569",
          "CVSS3": "5.6/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:C/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-20569",
          "CWE": "",
          "Public": "20230810"
        },
        {
          "ID": "CVE-2023-20588",
          "CVSS3": "6.0/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-20588",
          "CWE": "CWE-369",
          "Public": "20230819"
        },
        {
          "ID": "CVE-2023-20593",
          "CVSS3": "6.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-20593",
          "CWE": "CWE-1239",
          "Public": "20230725"
        },
        {
          "ID": "CVE-2023-28464",
          "CVSS3": "7.1/CVSS:3.1/AV:A/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-28464",
          "CWE": "CWE-415",
          "Public": "20230328"
        },
        {
          "ID": "CVE-2023-2860",
          "CVSS3": "4.4/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-2860",
          "CWE": "CWE-125",
          "Public": "20230627"
        },
        {
          "ID": "CVE-2023-3006",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-3006",
          "CWE": "CWE-226",
          "Public": "20230531"
        },
        {
          "ID": "CVE-2023-31083",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-31083",
          "CWE": "",
          "Public": "20230424"
        },
        {
          "ID": "CVE-2023-31085",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-31085",
          "CWE": "",
          "Public": "20230424"
        },
        {
          "ID": "CVE-2023-3358",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-3358",
          "CWE": "CWE-476",
          "Public": "20230621"
        },
        {
          "ID": "CVE-2023-3567",
          "CVSS3": "6.7/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-3567",
          "CWE": "CWE-416",
          "Public": "20230709"
        },
        {
          "ID": "CVE-2023-3772",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-3772",
          "CWE": "CWE-476",
          "Public": "20230724"
        },
        {
          "ID": "CVE-2023-3863",
          "CVSS3": "6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-3863",
          "CWE": "CWE-416",
          "Public": "20230625"
        },
        {
          "ID": "CVE-2023-39192",
          "CVSS3": "6.7/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:C/C:H/I:N/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-39192",
          "CWE": "CWE-125",
          "Public": "20231009"
        },
        {
          "ID": "CVE-2023-4015",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4015",
          "CWE": "CWE-416",
          "Public": "20230906"
        },
        {
          "ID": "CVE-2023-4132",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4132",
          "CWE": "CWE-416",
          "Public": "20230803"
        },
        {
          "ID": "CVE-2023-4155",
          "CVSS3": "5.3/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:C/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4155",
          "CWE": "CWE-367",
          "Public": "20230807"
        },
        {
          "ID": "CVE-2023-42753",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-42753",
          "CWE": "CWE-191-\u003eCWE-787",
          "Public": "20230925"
        },
        {
          "ID": "CVE-2023-42754",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-42754",
          "CWE": "CWE-476",
          "Public": "20231116"
        },
        {
          "ID": "CVE-2023-42755",
          "CVSS3": "6.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-42755",
          "CWE": "CWE-125",
          "Public": "20230925"
        },
        {
          "ID": "CVE-2023-45863",
          "CVSS3": "6.4/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-45863",
          "CWE": "",
          "Public": "20231014"
        },
        {
          "ID": "CVE-2023-45871",
          "CVSS3": "7.5/CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-45871",
          "CWE": "CWE-120",
          "Public": "20231031"
        },
        {
          "ID": "CVE-2023-4622",
          "CVSS3": "6.6/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:L/I:L/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4622",
          "CWE": "CWE-416",
          "Public": "20230906"
        },
        {
          "ID": "CVE-2023-4623",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4623",
          "CWE": "CWE-416",
          "Public": "20230906"
        },
        {
          "ID": "CVE-2023-4921",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-4921",
          "CWE": "CWE-416",
          "Public": "20230912"
        },
        {
          "ID": "CVE-2023-51042",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-51042",
          "CWE": "CWE-416",
          "Public": "20240123"
        },
        {
          "ID": "CVE-2023-51779",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-51779",
          "CWE": "CWE-362-\u003eCWE-416",
          "Public": "20240123"
        },
        {
          "ID": "CVE-2023-5178",
          "CVSS3": "8.8/CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-5178",
          "CWE": "CWE-415-\u003eCWE-416",
          "Public": "20231031"
        },
        {
          "ID": "CVE-2023-52438",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-52438",
          "CWE": "CWE-416",
          "Public": "20240219"
        },
        {
          "ID": "CVE-2023-52445",
          "CVSS3": "3.0/CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:L/A:L",
          "Impact": "Low",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-52445",
          "CWE": "CWE-416",
          "Public": "20240228"
        },
        {
          "ID": "CVE-2023-5717",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-5717",
          "CWE": "CWE-787",
          "Public": "20231025"
        },
        {
          "ID": "CVE-2023-6176",
          "CVSS3": "4.4/CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6176",
          "CWE": "",
          "Public": "20231115"
        },
        {
          "ID": "CVE-2023-6546",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6546",
          "CWE": "CWE-362-\u003eCWE-416",
          "Public": "20231221"
        },
        {
          "ID": "CVE-2023-6817",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6817",
          "CWE": "CWE-416",
          "Public": "20240403"
        },
        {
          "ID": "CVE-2023-6915",
          "CVSS3": "6.5/CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6915",
          "CWE": "CWE-476",
          "Public": "20240114"
        },
        {
          "ID": "CVE-2023-6931",
          "CVSS3": "5.8/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:L/I:L/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6931",
          "CWE": "CWE-787",
          "Public": "20231219"
        },
        {
          "ID": "CVE-2023-6932",
          "CVSS3": "7.8/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2023-6932",
          "CWE": "CWE-416",
          "Public": "20231218"
        },
        {
          "ID": "CVE-2024-0565",
          "CVSS3": "6.8/CVSS:3.1/AV:A/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-0565",
          "CWE": "CWE-191",
          "Public": "20240115"
        },
        {
          "ID": "CVE-2024-0646",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-0646",
          "CWE": "",
          "Public": "20240403"
        },
        {
          "ID": "CVE-2024-1086",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-1086",
          "CWE": "CWE-416",
          "Public": "20240130"
        },
        {
          "ID": "CVE-2024-22099",
          "CVSS3": "6.3/CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:C/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-22099",
          "CWE": "CWE-476",
          "Public": "20240125"
        },
        {
          "ID": "CVE-2024-23307",
          "CVSS3": "4.4/CVSS:3.1/AV:N/AC:H/PR:H/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-23307",
          "CWE": "CWE-190",
          "Public": "20240125"
        },
        {
          "ID": "CVE-2024-24855",
          "CVSS3": "4.7/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-24855",
          "CWE": "CWE-367",
          "Public": "20240205"
        },
        {
          "ID": "CVE-2024-24860",
          "CVSS3": "5.3/CVSS:3.1/AV:A/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-24860",
          "CWE": "",
          "Public": "20240205"
        },
        {
          "ID": "CVE-2024-26589",
          "CVSS3": "7.0/CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-26589",
          "CWE": "CWE-822",
          "Public": "20240222"
        },
        {
          "ID": "CVE-2024-26597",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2024-26597",
          "CWE": "",
          "Public": "20240222"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:23:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "bpftool is earlier than 0:5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554001"
          },
          {
            "Comment": "kernel is earlier than 0:5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554002"
          },
          {
            "Comment": "kernel-core is earlier than 0:core-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554003"
          },
          {
            "Comment": "kernel-debug is earlier than 0:debug-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554004"
          },
          {
            "Comment": "kernel-debug-core is earlier than 0:debug-core-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554005"
          },
          {
            "Comment": "kernel-debug-devel is earlier than 0:debug-devel-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554006"
          },
          {
            "Comment": "kernel-debug-modules is earlier than 0:debug-modules-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554007"
          },
          {
            "Comment": "kernel-debug-modules-extra is earlier than 0:debug-modules-extra-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554008"
          },
          {
            "Comment": "kernel-devel is earlier than 0:devel-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554009"
          },
          {
            "Comment": "kernel-headers is earlier than 0:headers-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554010"
          },
          {
            "Comment": "kernel-modules is earlier than 0:modules-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554011"
          },
          {
            "Comment": "kernel-modules-extra is earlier than 0:modules-extra-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554012"
          },
          {
            "Comment": "kernel-tools is earlier than 0:tools-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554013"
          },
          {
            "Comment": "kernel-tools-libs is earlier than 0:tools-libs-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554014"
          },
          {
            "Comment": "kernel-tools-libs-devel is earlier than 0:tools-libs-devel-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554015"
          },
          {
            "Comment": "perf is earlier than 0:5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554016"
          },
          {
            "Comment": "python3-perf is earlier than 0:perf-5.10.134-17.an23",
            "TestRef": "oval:cn.openanolis:tst:20240554017"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 23 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}