{
  "ID": "oval:cn.openanolis:def:20220018",
  "Version": "1",
  "Class": "patch",
  "Metadata": {
    "Title": "ANSA-2022:0018: python-pillow security update (Important)",
    "Affected": {
      "Family": "unix",
      "Platform": [
        "Anolis OS 8"
      ]
    },
    "References": [
      {
        "RefID": "ANSA-2022:0018",
        "RefURL": "https://anas.openanolis.cn/errata/detail/ANSA-2022:0018",
        "Source": "ANSA"
      }
    ],
    "Description": "Package updates are available for Anolis 8 that fix the following vulnerabilities:\n\nCVE-2022-22816:\npath_getbbox in path.c in Pillow before 9.0.0 has a buffer over-read during initialization of ImagePath.Path.\n\nCVE-2022-22817:\nPIL.ImageMath.eval in Pillow before 9.0.0 allows evaluation of arbitrary expressions, such as ones that use the Python exec method.\n\nCVE-2020-35653:\nIn Pillow before 8.1.0, PcxDecode has a buffer over-read when decoding a crafted PCX file because the user-supplied stride value is trusted for buffer calculations.\nA flaw was found in python-pillow. The PcxDecode in Pillow has a buffer over-read when decoding a crafted PCX file due to the user-supplied stride value trusted for buffer calculations. The highest threat from this vulnerability is to system availability.\n\nCVE-2020-35655:\nIn Pillow before 8.1.0, SGIRleDecode has a 4-byte buffer over-read when decoding crafted SGI RLE image files because offsets and length tables are mishandled.\nA flaw was found in python-pillow. SGIRleDecode has a 4-byte buffer over-read when decoding crafted SGI RLE image files because offsets and length tables are mishandled.\n\nCVE-2021-25287:\nAn issue was discovered in Pillow before 8.2.0. There is an out-of-bounds read in J2kDecode, in j2ku_graya_la.\nThere is an out-of-bounds read in J2kDecode in j2ku_graya_la. For J2k images with multiple bands, it’s legal to have different widths for each band, e.g. 1 byte for L, 4 bytes for A.\n\nCVE-2021-25288:\nAn issue was discovered in Pillow before 8.2.0. There is an out-of-bounds read in J2kDecode, in j2ku_gray_i.\nThere is an out-of-bounds read in J2kDecode in j2ku_gray_i. For J2k images with multiple bands, it’s legal to have different widths for each band, e.g. 1 byte for L, 4 bytes for A.\n\nCVE-2021-25290:\nAn issue was discovered in Pillow before 8.1.1. In TiffDecode.c, there is a negative-offset memcpy with an invalid size.\nA flaw was found in python-pillow. In TiffDecode.c, there is a negative-offset memcpy with an invalid size which could lead to a system crash.\n\nCVE-2021-25292:\nAn issue was discovered in Pillow before 8.1.1. The PDF parser allows a regular expression DoS (ReDoS) attack via a crafted PDF file because of a catastrophic backtracking regex.\nA flaw was found in python-pillow. The PDF parser has a catastrophic backtracking regex that could be used as a DOS attack.\n\nCVE-2021-25293:\nAn issue was discovered in Pillow before 8.1.1. There is an out-of-bounds read in SGIRleDecode.c.\nA flaw was found in python-pillow. There is an Out of Bounds Read in SGIRleDecode.c.\n\nCVE-2021-27921:\nPillow before 8.1.1 allows attackers to cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for a BLP container, and thus an attempted memory allocation can be very large.\nA flaw was found in python-pillow. Attackers can cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for a BLP container, and thus an attempted memory allocation can be very large.\n\nCVE-2021-27922:\nPillow before 8.1.1 allows attackers to cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for an ICNS container, and thus an attempted memory allocation can be very large.\nA flaw was found in python-pillow. Attackers can cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for an ICNS container, and thus an attempted memory allocation can be very large.\n\nCVE-2021-27923:\nPillow before 8.1.1 allows attackers to cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for an ICO container, and thus an attempted memory allocation can be very large.\nA flaw was found in python-pillow. Attackers can cause a denial of service (memory consumption) because the reported size of a contained image is not properly checked for an ICO container, and thus an attempted memory allocation can be very large.\n\nCVE-2021-28675:\nAn issue was discovered in Pillow before 8.2.0. PSDImagePlugin.PsdImageFile lacked a sanity check on the number of input layers relative to the size of the data block. This could lead to a DoS on Image.open prior to Image.load.\nA flaw was found in python-pillow. PsdImagePlugin.PsdImageFile does not sanity check the number of input layers with regard to the size of the data block which could lead to a denial-of-service.\n\nCVE-2021-28676:\nAn issue was discovered in Pillow before 8.2.0. For FLI data, FliDecode did not properly check that the block advance was non-zero, potentially leading to an infinite loop on load.\nA flaw was found in python-pillow. FliDecode.c did not properly check that the block advance was non-zero, potentially leading to an infinite loop on load. This issue dates to the PIL fork. The highest threat from this vulnerability is to system availability.\n\nCVE-2021-28678:\nAn issue was discovered in Pillow before 8.2.0. For BLP data, BlpImagePlugin did not properly check that reads (after jumping to file offsets) returned data. This could lead to a DoS where the decoder could be run a large number of times on empty data.\nA flaw was found in python-pillow. BlpImagePlugin did not properly check that reads after jumping to file offsets returned data. This could lead to a denial-of-service where the decoder could be run a large number of times on empty data.\n\nCVE-2021-34552:\nPillow through 8.2.0 and PIL (aka Python Imaging Library) through 1.1.7 allow an attacker to pass controlled parameters directly into a convert function to trigger a buffer overflow in Convert.c.\nA flaw was found in python-pillow. This flaw allows an attacker to pass controlled parameters directly into a convert function, triggering a buffer overflow in the \"convert()\" or \"ImagingConvertTransparent()\" functions in Convert.c. The highest threat to this vulnerability is to system availability.\nIn Red Hat Quay, a vulnerable version of python-pillow is shipped with quay-registry-container, however the invoice generation feature which uses python-pillow is disabled by default. Therefore impact has been rated Moderate.\n\nCVE-2021-28677：\nAn issue was discovered in Pillow before 8.2.0. For EPS data, the readline implementation used in EPSImageFile has to deal with any combination of \\r and \\n as line endings. It used an accidentally quadratic method of accumulating lines while looking for a line ending. A malicious EPS file could use this to perform a DoS of Pillow in the open phase, before an image was accepted for opening.\nA flaw was found in python-pillow. The readline used in EPS has to deal with any combination of \\r and \\n as line endings. It accidentally used a quadratic method of accumulating lines while looking for a line ending. A malicious EPS file could use this to perform a denial-of-service of Pillow in the open phase, before an image was accepted for opening.",
    "Advisory": {
      "Severity": "Important",
      "Issued": {
        "Date": "2022-02-23"
      },
      "Updated": {
        "Date": "2022-11-11"
      },
      "Cves": [
        {
          "ID": "CVE-2022-22816",
          "CVSS3": "6.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-22816",
          "CWE": "CWE-125",
          "Public": "20220223"
        },
        {
          "ID": "CVE-2022-22817",
          "CVSS3": "9.8/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H",
          "Impact": "Critical",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2022-22817",
          "CWE": "CWE-77",
          "Public": "20220223"
        },
        {
          "ID": "CVE-2020-35653",
          "CVSS3": "7.1/CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-35653",
          "CWE": "CWE-20-\u003eCWE-125",
          "Public": "20210103"
        },
        {
          "ID": "CVE-2020-35655",
          "CVSS3": "5.4/CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:L",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2020-35655",
          "CWE": "CWE-122-\u003eCWE-125",
          "Public": "20210103"
        },
        {
          "ID": "CVE-2021-25287",
          "CVSS3": "9.1/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H",
          "Impact": "Critical",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-25287",
          "CWE": "CWE-125",
          "Public": "20210401"
        },
        {
          "ID": "CVE-2021-25288",
          "CVSS3": "9.1/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H",
          "Impact": "Critical",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-25288",
          "CWE": "CWE-125",
          "Public": "20210401"
        },
        {
          "ID": "CVE-2021-25290",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-25290",
          "CWE": "CWE-120",
          "Public": "20210228"
        },
        {
          "ID": "CVE-2021-25292",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-25292",
          "CWE": "CWE-20",
          "Public": "20210228"
        },
        {
          "ID": "CVE-2021-25293",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-25293",
          "CWE": "CWE-125",
          "Public": "20210228"
        },
        {
          "ID": "CVE-2021-27921",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-27921",
          "CWE": "CWE-20-\u003eCWE-400",
          "Public": "20210303"
        },
        {
          "ID": "CVE-2021-27922",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-27922",
          "CWE": "CWE-20-\u003eCWE-400",
          "Public": "20210303"
        },
        {
          "ID": "CVE-2021-27923",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-27923",
          "CWE": "CWE-20-\u003eCWE-400",
          "Public": "20210303"
        },
        {
          "ID": "CVE-2021-28675",
          "CVSS3": "5.5/CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-28675",
          "CWE": "CWE-20",
          "Public": "20210401"
        },
        {
          "ID": "CVE-2021-28676",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-28676",
          "CWE": "CWE-20-\u003eCWE-835",
          "Public": "20210401"
        },
        {
          "ID": "CVE-2021-28678",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-28678",
          "CWE": "CWE-20",
          "Public": "20210401"
        },
        {
          "ID": "CVE-2021-34552",
          "CVSS3": "5.9/CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Moderate",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-34552",
          "CWE": "CWE-119",
          "Public": "20210713"
        },
        {
          "ID": "CVE-2021-28677",
          "CVSS3": "7.5/CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H",
          "Impact": "Important",
          "Href": "https://anas.openanolis.cn/cves/detail/CVE-2021-28677",
          "CWE": "CWE-20",
          "Public": "20210401"
        }
      ],
      "AffectedCpeList": [
        "cpe:2.3:o:openanolis:anolis_os:8:*:*:*:*:*:*:* "
      ]
    }
  },
  "Criteria": {
    "Operator": "AND",
    "Criterias": [
      {
        "Operator": "OR",
        "Criterias": null,
        "Criterions": [
          {
            "Comment": "python3-pillow is earlier than 0:pillow-5.1.1-18.an8_5",
            "TestRef": "oval:cn.openanolis:tst:20220018001"
          },
          {
            "Comment": "python-pillow is earlier than 0:pillow-5.1.1-18.an8_5",
            "TestRef": "oval:cn.openanolis:tst:20220018002"
          },
          {
            "Comment": "python3-pillow-doc is earlier than 0:pillow-doc-5.1.1-18.an8_5",
            "TestRef": "oval:cn.openanolis:tst:20220018003"
          }
        ]
      }
    ],
    "Criterions": [
      {
        "Comment": "Anolis OS 8 is installed",
        "TestRef": "oval:cn.openanolis:tst:1"
      }
    ]
  }
}